Repository: ystk/debian-nss-pam-ldapd
Catalog: debian/po/*.po
Languages: fi, it

source: LDAP server URI:
fi: LDAP-palvelimen URI:
it: URI del server LDAP:

source: Please enter the Uniform Resource Identifier of the LDAP server. The format is 'ldap://<hostname_or_IP_address>:<port>/'. Alternatively, 'ldaps://' or 'ldapi://' can be used. The port number is optional.
fi: Anna käytettävän LDAP-palvelimen URI (Uniform Resource Identifier). Merkkijonon muoto on ”ldap://<verkkonimi tai IP-osoite>:<portti>/”. Myös skeemoja ”ldaps://” ja ”ldapi://” voidaan käyttää. Porttinumero ei ole pakollinen.
it: Inserire l'Uniform Resource Identifier (URI) del server LDAP. Il formato è «ldap://<nomehost o indirizzo IP>:<porta>»; è anche possibile usare «ldaps://» oppure «ldapi://». Il numero della porta è facoltativo.

source: When using an ldap or ldaps scheme it is recommended to use an IP address to avoid failures when domain name services are unavailable.
fi: Käytettäessä ldap- ja ldaps-skeemoja on suositeltavaa käyttää IP-osoitetta, koska tällöin nimipalvelun toimimattomuus ei aiheuta toimintahäiriötä.
it: Quando si usa lo schema ldap o ldaps si raccomanda di usare un indirizzo IP, al fine di ridurre i rischi di errore quando i servizi dei nomi di dominio non sono disponibili.

source: Multiple URIs can be specified by separating them with spaces.
fi: Voit syöttää useamman URIn erottamalla ne välilyönneillä.
it: È possibile specificare URI multipli, dividendoli con spazi.

source: LDAP server search base:
fi: LDAP-palvelimen hakukanta:
it: Base di ricerca del server LDAP:

source: Please enter the distinguished name of the LDAP search base. Many sites use the components of their domain names for this purpose. For example, the domain "example.net" would use "dc=example,dc=net" as the distinguished name of the search base.
fi: Anna LDAP-hakukannan erittelevä nimi (Distinguished Name, DN). Useilla sivustoilla käytetään verkkonimen osia tähän tarkoitukseen. Esimerkiksi verkkotunnus ”esimerkki.fi” käyttäisi nimeä ”dc=esimerkki,dc=fi” hakukannan erittelevänä nimenä.
it: Inserire il DN (distinguished name) della base di ricerca LDAP. A tal fine molti siti usano le componenti del loro nome di dominio: ad esempio, il dominio «esempio.net» userebbe «dc=esempio,dc=net» come DN della base di ricerca.

source: LDAP database user:
fi: LDAP-tietokannan käyttäjätunnus:
it: Utente del database LDAP:

source: If the LDAP database requires a login for normal lookups, enter the name of the account that will be used here. Leave it empty otherwise.
fi: Jos LDAP-tietokannan täytyy kirjautua tehdäkseen normaaleja hakuja, anna käytettävän tunnuksen nimi tässä. Jätä muuten kenttä tyhjäksi.
it: Se il database LDAP richiede l'accesso per le normali ricerche, inserire il nome dell'account che verrà utilizzato per l'accesso. In caso contrario, lasciare vuoto.

source: This value should be specified as a DN (distinguished name).
fi: Tämä arvo tulisi antaa erittelevänä nimenä.
it: Questo valore dovrebbe essere specificato come DN (distinguished name).

source: LDAP user password:
fi: LDAP-tunnuksen salasana:
it: Password dell'utente LDAP:

source: Enter the password that will be used to log in to the LDAP database.
fi: Anna salasana, jota käytetään kirjauduttaessa LDAP-tietokantaan.
it: Inserire la password che verrà utilizzata per accedere al database LDAP.

source: Use StartTLS?
fi: Käytetäänkö StartTLS:ää?
it: Utilizzare StartTLS?

source: Please choose whether the connection to the LDAP server should use StartTLS to encrypt the connection.
fi: Valitse tulisiko LDAP-palvelimelle otettava yhteys salata käyttäen StartTLS:ää.
it: Scegliere se la connessione al server LDAP deve utilizzare StartTLS per cifrare la connessione.

source: never
fi: ei koskaan
it: mai

source: allow
fi: salli
it: consenti

source: try
fi: yritä
it: prova

source: demand
fi: vaadi
it: richiedi

source: Check server's SSL certificate:
fi: Palvelimen SSL-varmenteen tarkistus:
it: Controllare il certificato del server SSL?

source: When an encrypted connection is used, a server certificate can be requested and checked. Please choose whether lookups should be configured to require a certificate, and whether certificates should be checked for validity: * never: no certificate will be requested or checked; * allow: a certificate will be requested, but it is not required or checked; * try: a certificate will be requested and checked, but if no certificate is provided it is ignored; * demand: a certificate will be requested, required, and checked. If certificate checking is enabled, at least one of the tls_cacertdir or tls_cacertfile options must be put in /etc/nslcd.conf.
fi: Käytettäessä salattua yhteyttä, palvelimelta voidaan pyytää varmenne tarkastettavaksi. Valitse tulisiko hakujen pyytää varmennetta ja tulisiko varmenteiden oikeellisuus tarkastaa: * ei koskaan: Varmennetta ei pyydetä tai tarkasteta * salli: Varmenne pyydetään, mutta sitä ei vaadita tai tarkasteta * yritä: Varmenne pyydetään ja tarkastetaan, mutta jos sitä ei saada, tästä ei välitetä * vaadi: Varmenne vaaditaan ja tarkastetaan. Jos tarkastus on käytössä, tulisi ainakin toinen asetuksista tls_cacertdir ja tls_cacertfile laittaa tiedostoon /etc/nslcd.conf.
it: Quando viene utilizzata una connessione cifrata è possibile chiedere e controllare un certificato del server. Scegliere se le ricerche devono essere configurate per richiedere un certificato e se la validità dei certificati deve essere controllata: * mai: non verrà richiesto né controllato alcun certificato; * consenti: un certificato viene richiesto, ma non in modo vincolante, né viene controllato; * prova: un certificato verrà richiesto e controllato, ma la mancata fornitura di un certificato viene ignorata; * richiedi: viene chiesto in modo vincolante e controllato. Se è abilitata la richiesta di certificati, almeno una delle opzioni tls_cacertdir o tls_cacertfile devono trovarsi in «/etc/nslcd.conf».

source: Name services to configure:
fi: Asetettavat nimipalvelimet:
it: Servizi dei nomi da configurare:

source: For this package to work, you need to modify your /etc/nsswitch.conf to use the ldap datasource.
fi: Jotta tämä paketti toimisi, täytyy tiedosto /etc/nsswitch.conf muokata käyttämään ldap-tietolähdettä.
it: Affinché questo pacchetto funzioni è necessario modificare il proprio file «/etc/nsswitch.conf» in modo che utilizzi l'origine dati LDAP.

source: You can select the services that should have LDAP lookups enabled. The new LDAP lookups will be added as the last datasource. Be sure to review these changes.
fi: Voit valita palvelut, jotka tarvitsevat LDAP-hakuja. Uudet LDAP-haut lisätään viimeiseksi tietolähteeksi. Muista tarkastaa nämä muutokset.
it: È possibile selezionare i servizi che dovrebbero essere abilitati per le ricerche LDAP. Le nuove ricerche LDAP verranno aggiunte come ultima sorgente di dati. Ci si assicuri di controllare queste modifiche.

source: Remove LDAP from nsswitch.conf now?
fi: Poistetaan LDAP tiedostosta nsswitch.conf nyt?
it: Rimuovere LDAP da nsswitch.con ora?

source: The following services are still configured to use LDAP for lookups: ${services} but the libnss-ldapd package is about to be removed.
fi: Seuraavat palvelut käyttävät edelleen LDAP:ia hauissaan: ${services} Pakettia libnss-ldapd ollaan kuitenkin poistamassa.
it: I seguenti servizi sono tuttora configurati per utilizzare LDAP per le ricerche: ${services} ma il pacchetto libnss-ldapd sta per essere rimosso.

source: You are advised to remove the entries if you don't plan on using LDAP for name resolution any more. Not removing ldap from nsswitch.conf should, for most services, not cause problems, but host name resolution could be affected in subtle ways.
fi: On suositeltavaa poistaa tietueet, jos LDAP:ia ei aiota enää käyttää nimien selvittämiseen. Jos ldap jätetään tiedostoon nsswitch.conf, sen ei pitäisi useimpien palveluiden kohdalla aiheuttaa ongelmia, mutta konenimien selvitys saattaa muuttua joillain tavoilla.
it: Rimuovere le voci solo se si prevede di non utilizzare più LDAP per le risoluzioni dei nomi. Per la maggior parte dei servizi la mancata rimozione di LDAP da nsswitch.conf non dovrebbe causare problemi, ma la risoluzione dei nomi degli host potrebbe essere in qualche modo influenzata.

source: You can edit /etc/nsswitch.conf by hand or choose to remove the entries automatically now. Be sure to review the changes to /etc/nsswitch.conf if you choose to remove the entries now.
fi: Voit muokata tiedostoa /etc/nsswitch.conf käsin tai poistaa tietueet nyt automaattisesti. Muista tarkastaa tiedoston /etc/nsswitch.conf muutokset, jos poistat tietueet nyt.
it: È possibile modificare manualmente «/etc/nsswitch.conf» o scegliere di rimuovere le voci automaticamente adesso. Controllare le modifiche a «/etc/nsswitch.conf» se si sceglie la rimozione automatica.

source: Enable shadow lookups through NSS?
it: Abilitare le ricerche «shadow» tramite NSS?

source: To allow LDAP users to log in, the NSS module needs to be enabled to perform shadow password lookups. The shadow entries themselves may be empty - that is, there is no need for password hashes to be exposed. See http://bugs.debian.org/583492 for background.
it: Per consentire l'accesso agli utenti LDAP, il modulo NSS deve essere abilitato per le ricerche «shadow» di password. Le voci «shadow» possono essere vuote, ossia non è necessario esporre le hash delle password. Per maggiori informazioni consultare http://bugs.debian.org/583492.

source: Please choose whether /etc/nsswitch.conf should have the required entry added automatically (in which case it should be reviewed afterwards) or whether it should be left for an administrator to edit manually.
it: Scegliere se la voce richiesta deve essere aggiunta automaticamente a «/etc/nsswitch.conf» o se si preferisce l'immissione manuale da parte di un amministratore.
